[
  {
    "title": "Should I search for a job, and then move? Or move and then search?",
    "body": "I'm hoping to move somewhere else in the next year and wondering...\n\nShould I get a job and them move to where it is, or should I move and then search for jobs?\n\nI really want a fresh start, in a new town with a new job, but I don't know which should come first. I feel like I could argue for both sides, so I'd love some advice from other people",
    "tags": ["discuss", "career"],
    "image_url": null,
    "user_id": 1
  },
  {
    "title": "Why Microsoft and How I Achieved my Goal",
    "body": "##I started building websites in 1997\nI started building websites in 1997 before I even had access to the internet. I got my first job in tech in 1999 working with Dreamweaver. But it was very boring so I left after a year to have fun and be an entertainer on a stage in Mallorca. I had fun for a few years but then started studying again to try to get back into tech starting with flash and then moving on to wordpress.\n##My Dream - To work for a Cool Tech Company\nIt all changed 5 years ago when my life was not really going anywhere and I was pretty miserable. That's when I stared to do a dream builders course so I could change my life. My dream was to work for Google as a frontend developer. Wait a second you say, I thought this was titled \"Why Microsoft?\".\n\nLet me explain. At that time in my life Microsoft was not my dream. It wasn't the company that I know it to be today, so it wasn't my goal. During my dream builders course I was told to define Google. For me it was never about the cool offices or free food or whatever else makes Google cool. It was about working with a great team of people, it was about being able to make a difference, it was about always being able to learn and improve, and I won't lie in saying it was also about working for a company that wasn't going to close down after a few years.\n##Becoming Microsoft Certified\nAfter leaving my teaching job and freelance dev work I went back to full time study in February 2017, to learn JavaScript, in the hope to get a job at a great company. I never thought I would ever get hired by Google but I always feel you have to reach for the stars and aim as high as possible. After about 9 months of full time studying I got a job as a real frontend developer in Bluekiri in November of 2017.\n\nThis is when things changed. This company were Microsoft Partners and the CEO encouraged everyone to write blog posts, speak at conferences, collaborate on Open Source and be Microsoft certified, an achievement that was not easy, but that I am very proud of.\n##Building Chat Bots with the Microsoft Guys\nWhile working there we were tasked to build chat bots in Node.js. I in no way had close to enough experience, but was allowed to shadow the project and build some of the UI for the chat bots dashboard. Microsoft sent us 2 people to help us build these chat bots. The developers sat with us and programmed the chat bots with us and helped us better understand the product we were using. It was so much fun.\n##My dream came true\nI still can't quite believe I actually got the job. I'm still on a high and floating in the clouds. 5 years ago I used all my life savings to study and learn JavaScript and now at 43 years of age (yes I know you all think I am only 21) I get to work for Microsoft. It really is just incredible what one can achieve.",
    "tags": ["webdev", "career"],
    "image_url": "https://devify-app-development.s3.amazonaws.com/webdev.jpeg",
    "user_id": 1
  },
  {
    "title": "Pitch me on swift?",
    "body": "Let's say I've never used Swift before. Can anyone give the run down of what the language does and why you prefer it? Feel free to touch on drawbacks as well.",
    "tags": ["discuss", "ios", "swift", "pitchme"],
    "image_url": "https://devify-app-development.s3.amazonaws.com/2wglu33w9l1iiu1c4t67.webp",
    "user_id": 1
  },
  {
    "title": "JavaScript Array Methods Explained",
    "body": "##concat()\nReturns a new array that is this array joined with other array(s) and/or values(s).\n\ncopyWithin()\nCopies a sequence of array elements within the array.\n\n##every()\nReturns true if every element in this array satisfies the testing function.\n\n##fill()\nFills all the elements of an array from a start index to an end index with a static value.\n\n##Happy coding! 💗\nIf you have any questions, leave a comment!",
    "tags": ["tutorial", "javascript", "programming"],
    "image_url": "https://devify-app-development.s3.amazonaws.com/jsbackground.png",
    "user_id": 1
  },
  {
    "title": "Why Beginners Should learn React",
    "body": "##What is ReactJs?\nReact is a popular JavaScript library used to build user interfaces and single-page applications.\n\nFacebook and an open-source developer community run it. Although React is a library rather than a framework, it is widely used in web development. The library first appeared in May 2013 and is now one of the most commonly used frontend libraries for web development.\n##Why learn ReactJs?\nReactJs is easy to learn and more focused than other JavaScript frameworks and libraries. It also saves you time as it is component-based which is used to break complex HTML files into reusable bits of code and thus, helps build dynamic and beautiful websites. It is the most popular JavaScript framework with an 87.49% satisfaction rating from more than 17,000 users. Learning React opens the door to more job opportunities, and better pay, and has a vast community supporting it.\n##Conclusion\nReact is a popular JavaScript library used to build user interfaces and single-page applications which is maintained by Facebook.\n\nReact is an excellent tool with which to create interactive applications for mobile, web, and other platforms. React uses the component approach and thus helps build dynamic web apps.\n\nReactJs is the best library out there to learn in 2022 and it is worth learning it.",
    "tags": ["javascript", "webdev", "beginners", "react"],
    "image_url": "https://devify-app-development.s3.amazonaws.com/react.png",
    "user_id": 1
  }
]
